import numpy as np

# linspace()==============================================

# 0～1まで等間隔に区切って、要素数5の配列を生成
print(np.linspace(0,1,5))
# ⇒ [0.   0.25 0.5  0.75 1.  ]

# diff()==================================================

#各要素間の差で新たな配列を生成
print(np.diff([0, 1, 2, 3, 100, 600]))
# ⇒ [  1   1   1  97 500]

# concatenate() ==========================================

# 2つの配列を一つに結合する
# ※2つの引数の間にカンマが入っているものの、引数の見た目は2次元配列になる点に注意
#    ⇒concatenate([0, 1, 2], [3, 4]) とするとエラー発生
print(np.concatenate([[0, 1, 2], [3, 4]]))
print()
# ⇒ [0 1 2 3 4]

# bの各要素末尾にb1の各要素を追加
b = np.array([[1, 2, 8], [4, 5, 8]])
b1 = np.array([[10], [20]])    # 要素数はbの1次元目の要素数と合わせないとエラー
print(np.concatenate([b, b1], axis = 1))
print(np.hstack([b, b1])) # hstack()でも同様
"""
[[ 1  2  8 10]
 [ 4  5  8 20]]
"""

# bの要素にb1を追加
b2 = np.array([100, 200, 300]) # 要素数はbの2次元目の要素数と合わせないとエラー
print(np.vstack([b, b2]))
"""
[[  1   2   8]
 [  4   5   8]
 [100 200 300]]
"""